Table of Contents
 Interface IConnectionController
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Automation of IdeaConnection app
public interface IConnectionController
Properties
 IsConnected
Indicates whether communication with IdeaConnection.exe is alive.
bool IsConnected { get; }
Property Value
bool
Methods
 CloseProject()
Close the open project
int CloseProject()
Returns
int
 GenerateReport(int, ConnReportSettings)
Send a request to generate a connection report and return a blobstorage with its data
IBlobStorage GenerateReport(int conId, ConnReportSettings settings)
Parameters
conId int
Id of the requested connection
settings ConnReportSettings
Report settings
Returns
IBlobStorage
The instance of the blobstorage
 OpenProject(string)
Open idea con project in IdeaConnection
int OpenProject(string fileName)
Parameters
fileName string
The file path to the ideaCon.
Returns
int
Events
 ConnectionAppExited
Fires when IdeaConnection app exited.
event EventHandler ConnectionAppExited
Event Type
EventHandler
 Edit this page